{"intents":[
    { "tag":"greetings",
    "patterns":["hey","hello","hi","what's up ?","good day","good morning"],
    "responses":["Hi , would you like some suggestions about cities ?","Hey, can i recommed you some places where you can go ?"]}
,{ "tag":"goodbyes",
    "patterns":["see you ","goodbye","bye","bye bye"],
    "responses":["alright !!","have  a nice day !!","take care","goodbye !!"]
},
{ "tag":"age",
    "patterns":["how old are you","age","what is your age ?"],
    "responses":["ow i'm 21 years old","i'm old enough to help you :)","i'm just about your age HAHA"]
} 
,{ "tag":"name",
    "patterns":["what is your name ?","name ?","tell me your name ","how can i call you ?"],
    "responses":["my name is samia "]
},{ "tag":"accept",
    "patterns":["yes","yes i want some suggestions about hotels","i want some suggestions about otels ","i want to know some hotels ","best places to sleep"],
    "responses":[" Here is a list of  the best hotels in Morocco !! \\n tell me the city where you want the hotel  \\n Meknes – The Ninth Century Medina \\n \\n Asilah – Sandy Beaches And Prolonged City Walls\\n High Atlas – Paradise For Trekkers\\n Essaouira (Mogador) – For GOT Lovers!\\n Chefchaouen – Painted Ambiance\\n Sahara Desert – Glance Sunset Over Dunes\\n Rabat – Stunning Capital City\\n Casablanca – Modernity Yet Cultured\\n Ouarzazate – Arid Desert Sights\\n Marrakech – Bustling City With A Large Medina\\n Tinghir – Morocco’s Crown Jewel\\n Agadir – Thriving Seaside Resort Town\\n Fez – The Old Maghreb City \\n Oudaias Kasbah – Nation’s Most Picturesque Region\\n Tangier – European-Looking Moroccan City\\n Dades Valley – Panoramic Sights\\n Aït Ben Haddou – Ancient Ruins\\n Rose Valley – Fragrance All Around\\n Dakhla – Kitesurfing Hub "]
},{ "tag":" casa",
    "patterns":["describe casablanca to me ","what is casablanca","casa","casablanca"],
    "responses":[" Here is a list of  the best hotels in casablanca !! \\n choose the star \\n 4 stars \\n 3 stars  \\n 5 stars"]
} ,{ "tag":"5 stars  in casablanca ",
    "patterns":["5 stars","i want a hotel with 5 stars in casablanca "," 5 casablanca"],
    "responses":["Mövenpick Hotel Casablanca \\n Rond Point Hassan II Casablanca, Casablanca 20070, Morocco \\n Excellent 8.4  \\n Nightly base price for 1 night : $97 \\n Hotel combining lifestyle and design, for business & leisure. Centrally located within the business district and a short distance from the Old Medina, the 184-room Movenpick Hotel Casablanca offers the very best in contemporary comfort and convenience. From luxury over sized rooms equipped with a flat screen TV to a 16th floor spa boasting an open-air swimming pool. A wide variety of conference and meeting spaces with 3 unique restaurants provide international cuisine throughout the day \\n Activities :Fitness center, Massage \\n Internet : Wi-Fi available in all areas, Internet, Free Wi-Fi " ,"Farah Casablanca  \\n 160 Avenue Des Far, Casablanca 20000, Morocco \\n Good 7.2 \\n Nightly base price for 1 night : 77$ - $92 \\n The hotel completely renovated in 2007,features 279 rooms including 26 suites (Ambassador,junior, Presidential and Royal )enjoys a convenient location in the heart of Casablanca, it is situated in lovely spot close to the business district and shopping centers, the hotel overlooks the harbor and the main square of the city. \\n  Activities :Fitness center, Massage \\n Services :Conference rooms, Wedding services, Babysitting or child care, Business center, Car rental, Wake-up service, Daily housekeeping, Fax/photocopying, Concierge service, Currency exchange on-site, Hammam (Turkish bath), Laundry service, Meeting/Banquet facilities, Multi-lingual staff, Health club, Beauty salon, 24-hour security, Airport shuttle (surcharge), Shuttle service (additional charge) \\n  Internet : Wi-Fi available in all areas, Internet, Free Wi-Fi  "]

    
} ,{ "tag":"4 stars  in casablanca ",
    "patterns":["4 stars","i want a hotel with 4 stars in casablanca ","4"," 4 casablanca"],
    "responses":["Club Val D Anfa  \\n Angle Bd de l'Océan Atlantique &, Casablanca 20000, Morocco \\n Excellent 8.1  \\n Nightly base price for 1 night : $88-$120 \\n  Located in Casablanca (Ain Diab), Club Val D Anfa is within a 10-minute drive of Morocco Mall and Marina Casablanca. Featured amenities include complimentary wired Internet access, a business center, and express check-in. Free valet parking is available onsite \\n Activities :Golf, Fitness center, Massage \\n  Services : Business center, Car rental, Wake-up service, Daily housekeeping, Fax/photocopying, Concierge service, Currency exchange on-site, Laundry service, Meeting/Banquet facilities, Multi-lingual staff, Face masks for guests available, Health club, Spa, Beauty salon, 24-hour security, Shuttle service (additional charge), Conference rooms \\n Internet : Wi-Fi available in all areas, Internet, Free Wi-Fi  ","Park Suites Hotel & Spa  \\n 55,Avenue Hassan II Angle Rue de Terves, Casablanca 20000, Morocco\\n Good 7.5  \\n Nightly base price for 1 night : $62-$84 \\n Located in Casablanca (Casablanca City Center), Park Suites Hotel & Spa is within a 10-minute drive of Central Market of Casablanca and Casablanca Twin Center. Featured amenities include limo/town car service, express check-in, and dry cleaning/laundry services. For a surcharge, guests may use a roundtrip airport shuttle (available 24 hours) and a train station pick-up service. \\n Activities : Evening entertainment, Fitness center, Karaoke, Public bath, Massage \\n  Services :Business center, Car rental, Wake-up service, Daily housekeeping, Fax/photocopying, Fax, Concierge service, Currency exchange on-site, Grocery deliveries, Hammam (Turkish bath), Laundry service, Multi-lingual staff, Special diet menus (on request), Health club, Spa, Key access, 24-hour security, Airport shuttle (surcharge), Shuttle service (additional charge), Ticket service \\n Internet : Wi-Fi available in all areas, Internet, Free Wi-Fi "]

    
} ,{ "tag":"3 stars  in casablanca ",
    "patterns":["2 stars","i want a hotel with 3 stars in casablanca ","3"," 3 casablanca"],
    "responses":["Pestana Casablanca \\n Anfa Place Living Resort, Boulevard de La Corniche, Casablanca 20200, Morocco \\n Excellent 8.3  \\n Nightly base price for 1 night : $107-$136 \\n  LWith a stay at Pestana Casablanca in Casablanca (Ain Diab), you'll be within a 15-minute drive of Ain Diab Beach and Morocco Mall. Featured amenities include a business center, dry cleaning/laundry services, and a 24-hour front desk. This aparthotel has 4 meeting rooms available for events. Free self parking is available onsite. \\n  Services :Business center, Car rental, Wake-up service, Daily housekeeping, Fax/photocopying, Concierge service, Currency exchange on-site, Laundry service, Meeting/Banquet facilities, Key access, 24-hour security, Ticket service \\n Internet : Wi-Fi available in all areas, Internet, Free Wi-Fi   ","Hotel good plan casa  \\n Hotel Diouri Casa 21 Route Azemmour Sun Square, Casablanca 20024, Morocco  \\n Located in Dar Bouazza, 19 km from Boat Ramp Port, Hotel good plan casa provides air-conditioned rooms and a restaurant. This 3-star hotel offers room service. Guests can have a drink at the bar. The nearest airport is Mohammed V International Airport, 25 km from the hotel. \\n  Services : Restaurant, Bar  /Lounge, Air-conditioned, Room service, Bathtub \\n Internet : Wi-Fi available in all areas, Internet, Free Wi-Fi "]


    
    
},{ "tag":" Marrakech",
    "patterns":["describe Marrakech to me ","what is Marrakech","Marrakech","Marrakesh"],
    "responses":[" Here is a list of  the best hotels in Marrakech !! \\n choose the star  \\n 4 stras \\n 3 stars  \\n 5 stars"]    
    
} ,{ "tag":"5 stars  in Marrakech ",
    "patterns":["5 stars","i want a hotel with 5 stars in Marrakech ","5"," 5 Marrakech"],
    "responses":["Eden Andalou Suites, Aquapark & Spa  \\n Km 4, Route d'Amezmiz, Marrakech 40000, Morocco \\n Excellent 9.0 \\n Nightly base price for 1 night : $219 - $234 \\n Located in Tameslouht, Eden Andalou Suites, Aquapark & Spa is in the suburbs, a 5-minute drive from Royal Club Equestrian Center and 6 minutes from Noria Golf Club. Featured amenities include a business center, express check-out, and dry cleaning/laundry services. Planning an event in Tameslouht? This hotel has facilities measuring 12917 square feet (1200 square meters), including a conference center. A roundtrip airport shuttle is provided for a surcharge (available 24 hours), and free self parking is available onsite \\n Activities :Eco tourism, Board games/puzzles, Game room, Golf, Darts, Evening entertainment, Fitness center, Kids' club, Kids' outdoor play  equipment, Table tennis , Playground, Water park, Massage   \\n services : Eco tourism, Board games/puzzles, Game room, Golf  , Darts, Evening entertainment, Fitness center, Kids' club, Kids' outdoor play equipment, Table tennis, Playground, Water park, Massage \\n Internet : Wi-Fi available in all areas, Internet, Free Wi-Fi " ,"La Maison Arabe Hotel, Spa And Cooking Workshops   \\n 1, Derb Assehbé, Bab Doukkala, Marrakech, Morocco \\n Excellent 9.4 \\n Nightly base price for 1 night : 157$ - $175 \\n A stay at La Maison Arabe Hotel, Spa and Cooking Workshops places you in the heart of Marrakech, within a 15-minute walk of Jemaa el-Fnaa and Le Jardin Secret. Featured amenities include a 24-hour business center, express check-out, and complimentary newspapers in the lobby. A shuttle from the hotel to the airport is provided for a surcharge (available 24 hours). \\n  Services :Babysitting or child care, Business center, Car rental, Wake-up service, Daily housekeeping, Fax/photocopying, Concierge service, Currency exchange on-site, Hammam (Turkish bath), Laundry service, Meeting/Banquet facilities, Multi-lingual staff, Special diet menus (on request), Contactless check-in/check-out, Spa  , 24-hour security  , Airport shuttle (surcharge), Shuttle service (additional charge), Ticket service \\n  Internet : Wi-Fi available in all areas, Internet, Free Wi-Fi  ","Les Jardins de la Koutoubia   \\n 26 Rue De La Koutoubia, Marrakech 40000, Morocco \\n Excellent 9.0 \\n Nightly base price for 1 night : 194$ - $201 \\n With a stay at Les Jardins De La Koutoubia in Marrakech (Medina), you'll be a 4-minute walk from Jemaa el-Fnaa and 9 minutes by foot from Le Jardin Secret. Featured amenities include complimentary newspapers in the lobby, dry cleaning/laundry services, and a 24-hour front desk. Event facilities at this hotel consist of conference space and a meeting room. A roundtrip airport shuttle is provided for a surcharge (available 24 hours), and free valet parking is available onsite. \\n  Services :Babysitting or child care, Car rental, Wake-up service, Daily housekeeping, Fax/photocopying, Concierge service, Currency exchange on-site, Hammam (Turkish bath), Laundry service, Meeting/Banquet facilities, Tour desk, Health club, Spa , Beauty salon , 24-hour security, Airport shuttle (surcharge), Shuttle service (additional charge), Conference rooms, Ticket service\\n  Internet : Wi-Fi available in all areas, Internet, Free Wi-Fi "]
    
    
} ,{ "tag":"4 stars  in Marrakech ",
    "patterns":["4 stars","i want a hotel with 4 stars in Marrakech ","4"," 4 Marrakech"],
    "responses":["Labranda Targa Aqua Parc  \\n Douar Bouchareb Targa, Marrakech, Maroc, 40000, Maroc, Marrakech, Morocco \\n Good 7.4 \\n Nightly base price for 1 night : $102-$134 \\n  When visiting the land of colors and contrast where do you stay? The enchanting country of Morocco has a lot to offer and see. From its attractive cities, wild beaches, exotic dessert and jaw-dropping snow-capped mountains. LABRANDA Targa Club Aqua Parc is a comfortable hotel located in enchanting Marrakech and the perfect place to explore this fascinating country. Located in one of Marrakechs newest residential areas, LABRANDA Targa Club Aqua Parc is housed in a modern structure with all that is required for a relaxing holiday. \\n  Services : Ticket service, Babysitting or child care, Business center, Wake-up service, Fax/photocopying, Concierge service, Entertainment staff, Currency exchange on-site, Hammam (Turkish bath), Laundry service, Meeting/Banquet facilities, Spa ♂️, Beauty salon , Shuttle service . \\n Internet : Wi-Fi available in all areas, Internet, Free Wi-Fi   ","Novotel Marrakech Hivernage  \\n Rue Haroun Errachid, Marrakech 40020, Morocco \\n Good 7.3  \\n Nightly base price for 1 night : $57-$91 \\n Discover the Novotel Marrakech Hivernage hotel in the middle of the trendiest part of Marrakech, where you can unwind and have fun in the many restaurants, casinos and Jet set clubs. You will love our cozy yet refined rooms. Take a stroll and discover the Koutoubia Mosque and the famous Jemaa el-Fna square. After a walk through the souks, relax in our outdoor swimming pool, and savor local delicacies in our casual, one-of-a-kind restaurant, Bazz'art. \\n Services : Babysitting or child care, Business center, Car rental, Fax/photocopying, Fax, Concierge service, Currency exchange on-site, Laundry service, Contactless check-in/check-out, Beauty salon , 24-hour security  \\n Internet : Wi-Fi available in all areas, Internet, Free Wi-Fi ","Aqua Mirage Club  \\n  Km 5, Route de Tahanaout, Marrakech 40065, Morocco \\n Excellent 9.3 \\n Nightly base price for 1 night : $142 - $172 \\n Set in Marrakech, this family-friendly property is within 9 mi (15 km) of Agdal Gardens, Menara Gardens, and Menara Mall. Jemaa el-Fnaa and Koutoubia Minaret are also within 9 mi (15 km). \\n  Services : Beauty salon , Concierge service, Laundry service, Meeting/Banquet facilities, Multi-lingual staff, Airport shuttle, Spa  \\n  Internet : Wi-Fi available in all areas, Internet, Free Wi-Fi "]
    
 
} ,{ "tag":"3 stars  in Marrakech ",
    "patterns":["3 stars","i want a hotel with 3 stars in Marrakech ","3"," 3 Marrakech"],
    "responses":["Almas Hotel   \\n 79, Avenue Moulay Rachid Gueliz, Marrakech 40000, Morocco \\n Excellent 8.1 \\n Nightly base price for 1 night : $41-$55 \\n  Almas Hotel With a stay at Almas Hotel, you'll be centrally located in Marrakech, just a 4-minute walk from Carré Eden Shopping Center and 5 minutes by foot from Marrakech Plaza. Featured amenities include express check-in, express check-out, and dry cleaning/laundry services. Planning an event in Marrakech? This hotel has facilities measuring 646 square feet (60 square meters), including a meeting room. A roundtrip airport shuttle is provided for a surcharge (available 24 hours), and self parking (subject to charges) is available onsite \\n  Services : Babysitting or child care, Wake-up service, Daily housekeeping, Fax/photocopying, Concierge service, Currency exchange on-site, Grocery deliveries, Laundry service, Meeting/Banquet facilities, Multi-lingual staff, Special diet menus (on request), Tour desk, 24-hour security , Airport shuttle (surcharge), Shuttle service (additional charge), Conference rooms, Ticket service. \\n Internet : Wi-Fi available in all areas, Internet, Free Wi-Fi ","Riad Andalla \\n 15 derb Zaari, Marrakech 40000, Morocco \\n Excellent 8.9  \\n Nightly base price for 1 night : $68-$71 \\n With a stay at Riad Andalla, you'll be centrally located in Marrakech, just a 3-minute walk from Jemaa el-Fnaa and 11 minutes by foot from Marrakesh Museum. Featured amenities include dry cleaning/laundry services, a 24-hour front desk, and luggage storage. Guests may use a roundtrip airport shuttle for a surcharge, and free self parking is available onsite. \\n Services :Ticket service, Concierge service, Laundry service, Contactless check-in/check-out, Tour desk, Face masks for guests available, 24-hour security , Airport shuttle (surcharge), Shuttle service (additional charge) \\n Internet : Wi-Fi available in all areas, Internet, Free Wi-Fi ","Ibis Marrakech Centre Gare \\n  Avenue Hassan II, Marrakech 40000, Morocco \\n Good 6.8 \\n Nightly base price for 1 night : $56 - $61 \\n In an ochre-colored building with touches of blue, ibis Marrakech Centre Gare offers 109 comfortable rooms with A/C, private bathroom, desk area, flat-screen TV and unlimited free WiFi. Its international restaurant serves an all-you-can-eat breakfast buffet, and its 24-hour bar and sunny garden with terrace and swimming pool promise savory moments of relaxation close to the tourist sites of the Red City. \\n  Services : Ticket service, Business center, Car rental, Fax/photocopying, Concierge service, Currency exchange on-site, Laundry service, Meeting/Banquet facilities, Multi-lingual staff, Special diet menus (on request), Contactless check-in/check-out, Tour desk, Face masks for guests available \\n  Internet : Wi-Fi available in all areas, Internet, Free Wi-Fi "]
     
    
    


}]}

